src/InformationRegisters/НастройкиКонтрольПроизводительности/НастройкиКонтрольПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПроизводительности</name>
  <resources>
    <name>ОповещатьПриУхудшенииАпдекса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПороговоеЗначениеПадения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогФайловОценкиПроизводительности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтрольПроизводительности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПрочитатьНастройки(КонтрольнаяПроцедура) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.Прочитать();
    
    Настройки = Новый Структура;
    Настройки.Вставить("КаталогФайловОценкиПроизводительности", МенеджерЗаписи.КаталогФайловОценкиПроизводительности);
    
    Настройки.Вставить("Расписание", МенеджерЗаписи.Расписание.Получить());
    
    Возврат Настройки;
    
КонецФункции

// Записать настройки
//
// Параметры:
//  КонтрольнаяПроцедура - СправочникСсылка.КонтрольныеПроцедуры - контрольная процедура, для которой записываются настройки.
//  Настройки            - Структура - структура создания с ключами:
//                                                            — ПороговаяПамять                    - Число(10,0), в мегабайтах.
//                                                            — СрокХраненияДанных                 - Число (10,0), часы.
//                                                            — АвтоматическиУдалятьЗаписиСеансов  - Булево.
//
Процедура ЗаписатьНастройки(КонтрольнаяПроцедура, Настройки) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.Прочитать();
    
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    
    Если Настройки.Свойство("КаталогФайловОценкиПроизводительности") Тогда
        МенеджерЗаписи.КаталогФайловОценкиПроизводительности = Настройки.КаталогФайловОценкиПроизводительности;
    КонецЕсли;
    
    Если Настройки.Свойство("Расписание") Тогда
        МенеджерЗаписи.Расписание = Новый ХранилищеЗначения(Настройки.Расписание);
    КонецЕсли;
    
    МенеджерЗаписи.Записать(Истина);
       
КонецПроцедуры

#КонецОбласти

#КонецЕсли
